wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
        pauseHoldStarted = false;
        pauseModeSelectingProfile = false;
        pauseModeSelectingGunId = false;
    }

    #ifdef MAMEHOOKER
        if(Serial.available()) OF_Serial::SerialProcessing();
    #endif // MAMEHOOKER

    switch(FW_Common::gunMode) {
        case FW_Const::GunMode_Pause:
            if(OF_Prefs::toggles[OF_Const::simplePause]) {
                if(pauseModeSelectingProfile) {
                    if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                        SetProfileSelection(false);
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                        SetProfileSelection(true);
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                        FW_Common::SelectCalProfile(profileModeSelection);
                        pauseModeSelectingProfile = false;
                        FW_Common::pauseModeSelection = FW_Const::PauseMode_AnalogCenterCal;

                        if(!OF_Serial::serialMode) {
                            Serial.print("Switched to profile: ");
                            Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                            Serial.println("Going back to the main menu...");
                            Serial.println("Selecting: Calibrate current profile");
                        }

                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                        #endif // USES_DISPLAY

                    } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                        if(!OF_Serial::serialMode)
                            Serial.println("Exiting profile selection.");

                        pauseModeSelectingProfile = false;

                        #ifdef LED_ENABLE
                            for(uint i = 0; i < 2; ++i) {
                                OF_RGB::LedUpdate(180,180,180);
                                delay(125);
                                OF_RGB::LedOff();
                                delay(100);
                            }
                            OF_RGB::LedUpdate(255,0,0);
                        #endif // LED_ENABLE

                        FW_Common::pauseModeSelection = FW_Const::PauseMode_AnalogCenterCal;

                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                        #endif // USES_DISPLAY
                    }
                } else if(pauseModeSelectingGunId) {
                    if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                        gunIdModeSelection = (gunIdModeSelection == 0) ? 3 : (gunIdModeSelection - 1);
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                        #endif
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                        gunIdModeSelection = (gunIdModeSelection >= 3) ? 0 : (gunIdModeSelection + 1);
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                        #endif
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                        OF_Prefs::settings[OF_Const::gunId] = gunIdModeSelection;
                        // 更新USB设备PID和名称
                        OF_Prefs::usb.devicePID = gunIdModeSelection + 1; // P1=1, P2=2, P3=3, P4=4
                        OF_Prefs::usb.deviceName[9] = '1' + gunIdModeSelection; // 更新名称中的P后面的数字
                        OF_Prefs::SaveSettings();
                        OF_Prefs::SaveUSBID();
                        pauseModeSelectingGunId = false;
                        FW_Common::pauseModeSelection = FW_Const::PauseMode_AnalogCenterCal;
                        if(!OF_Serial::serialMode) {
                            Serial.print("Gun ID set to P");
                            Serial.print((int)gunIdModeSelection + 1);
                            Serial.print(", USB PID: ");
                            Serial.println(OF_Prefs::usb.devicePID);
                            Serial.println("Please reconnect USB to apply changes.");
                        }
                        #ifdef USES_DISPLAY
                            {
                                char gunIdBuf[16];
                                snprintf(gunIdBuf, sizeof(gunIdBuf), "Gun ID: P%d", (int)gunIdModeSelection + 1);
                                FW_Common::OLED.TopPanelUpdate(gunIdBuf);
                            }
                            delay(800);
                            FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                        #endif
                    } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                        pauseModeSelectingGunId = false;
                        FW_Common::pauseModeSelection = FW_Const::PauseMode_AnalogCenterCal;
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                        #endif
                    }
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                    SetPauseModeSelection(false);
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                    SetPauseModeSelection(true);
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                    switch(FW_Common::pauseModeSelection) {
                        case FW_Const::PauseMode_Calibrate:
                          FW_Common::SetMode(FW_Const::GunMode_Calibration);
                          if(!OF_Serial::serialMode) {
                              Serial.print("Calibrating for current profile: ");
                              Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                          }
                          break;
                        case FW_Const::PauseMode_ProfileSelect:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Pick a profile!");
                              Serial.print("Current profile in use: ");
                              Serial.print(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                              Serial.print(" (");
                              Serial.print(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout ? "Diamond" : "Square");
                              Serial.println(")");
                          }
                          pauseModeSelectingProfile = true;
                          profileModeSelection = OF_Prefs::currentProfile;
                          #ifdef USES_DISPLAY
                              // 为每个配置文件名称添加布局类型信息
                              char profileNames[4][20]; // 为每个配置文件创建带布局信息的名称
                              for(int i = 0; i < PROFILE_COUNT; i++) {
                                  // 根据irLayout值添加布局类型
                                  if(OF_Prefs::profiles[i].irLayout) {
                                      snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Diamond)", OF_Prefs::profiles[i].name);
                                  } else {
                                      snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Square)", OF_Prefs::profiles[i].name);
                                  }
                              }
                              FW_Common::OLED.PauseProfileUpdate(profileModeSelection, profileNames[0], profileNames[1], profileNames[2], profileNames[3]);
                          #endif // USES_DISPLAY
                          #ifdef LED_ENABLE
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          break;
                        case FW_Const::PauseMode_Save:
                          if(!OF_Serial::serialMode)
                              Serial.println("Saving...");
                          FW_Common::SavePreferences();
                          break;
                        case FW_Const::PauseMode_AnalogRangeCal:
                        {
                            int pinX = OF_Prefs::pins[OF_Const::analogX];
                            int pinY = OF_Prefs::pins[OF_Const::analogY];
                            if (pinX < 0 || pinY < 0) {
                                if (!OF_Serial::serialMode)
                                    Serial.println("RangeCal: analog pins not set (analogX/analogY)");
                                break;
                            }

                            if (!OF_Serial::serialMode)
                                Serial.println("RangeCal: rotate stick full circle for ~4s...");

