wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
                          // Update display to show new layout
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond ? "Layout: Diamond" : "Layout: Square");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_LayoutToggle);
                          #endif // USES_DISPLAY
                          
                          // Provide visual feedback with color corresponding to layout type
                          #ifdef LED_ENABLE
                              if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                                  // Diamond layout - purple
                                  OF_RGB::LedUpdate(128,0,128);
                              } else {
                                  // Square layout - blue
                                  OF_RGB::LedUpdate(0,0,255);
                              }
                              delay(500);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          
                          // Save the layout change
                          OF_Prefs::SaveProfiles();
                          
                          break;
                        case FW_Const::PauseMode_GunId:
                          pauseModeSelectingGunId = true;
                          gunIdModeSelection = (uint8_t)(OF_Prefs::settings[OF_Const::gunId] % 4);
                          if(!OF_Serial::serialMode) {
                              Serial.println("Gun ID: select P1-P4");
                          }
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                          #endif
                          break;
                        // 在这里插入新的 “Send Analog Stick As” 选项
                        case FW_Const::PauseMode_AnalogMode:
                        {
                            // 模式顺序：0=Stick, 1=DPad, 2=Keys
                            uint32_t mode = OF_Prefs::settings[OF_Const::analogMode];
                            mode = (mode + 1) % 3;
                            OF_Prefs::settings[OF_Const::analogMode] = mode;
                            OF_Prefs::SaveSettings();

                            const char* modeStrSerial;
                            const char* modeStrShort;
                            switch (mode) {
                                default:
                                case OF_Const::analogModeStick:
                                    modeStrSerial = "Gamepad Analog Stick";
                                    modeStrShort  = "Stick: Gamepad";
                                    break;
                                case OF_Const::analogModeDpad:
                                    modeStrSerial = "Gamepad D-Pad";
                                    modeStrShort  = "Stick: D-Pad";
                                    break;
                                case OF_Const::analogModeKeys:
                                    modeStrSerial = "Keyboard Arrows";
                                    modeStrShort  = "Stick: Keys";
                                    break;
                            }

                            if (!OF_Serial::serialMode) {
                                Serial.print("Analog stick output mode set to ");
                                Serial.println(modeStrSerial);
                            }
                            #ifdef USES_DISPLAY
                                char buf[24];
                                snprintf(buf, sizeof(buf), "%s", modeStrShort);
                                FW_Common::OLED.TopPanelUpdate(buf);
                                FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogMode);
                            #endif
                        }
                        break;
                        case FW_Const::PauseMode_AnalogKeysLayout:
                        {
                            uint32_t layout = OF_Prefs::settings[OF_Const::analogKeysLayout];
                            layout = (layout == OF_Const::analogKeysLayoutWASD) ? OF_Const::analogKeysLayoutArrows : OF_Const::analogKeysLayoutWASD;
                            OF_Prefs::settings[OF_Const::analogKeysLayout] = layout;
                            OF_Prefs::SaveSettings();
                            const char* layoutStr = (layout == OF_Const::analogKeysLayoutWASD) ? "WASD" : "Arrows";
                            if (!OF_Serial::serialMode) {
                                Serial.print("Stick keys layout: ");
                                Serial.println(layoutStr);
                            }
                            #ifdef USES_DISPLAY
                                char buf[24];
                                snprintf(buf, sizeof(buf), "Stick Keys: %s", layoutStr);
                                FW_Common::OLED.TopPanelUpdate(buf);
                                FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogKeysLayout);
                            #endif
                        }
                        break;
                        case FW_Const::PauseMode_AnalogDeadzone:
                        // 死区步进：0,5,10,15,20,25,30%，用 Trigger 循环切换
                        {
                            // 当前值
                            uint32_t dz = OF_Prefs::settings[OF_Const::analogDeadzone];
                            if (dz > 30) dz = 30;

                            // 进入该选项时先显示当前死区值，避免画面空白
                            #ifdef USES_DISPLAY
                                {
                                    char buf[24];
                                    snprintf(buf, sizeof(buf), "Deadzone: %u%%", (unsigned)dz);
                                    FW_Common::OLED.TopPanelUpdate(buf);
                                    FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogDeadzone);
                                }
                            #endif

